# Задача 5. Модуль числа

data = int(input('Введите число: '))

if data >= 0:
    print('Модуль числа равен:', data)
else:
    print('Модуль числа равен:', data * (-1))