#Задача 3. Следим за зубами

today = int(input('Введите сегодняшнее число: '))

if today % 2 == 0:
    print('Пора использовать зубную нить!')
else:
    print('Сегодня нечётный день!')