# Задача 10. Максимальное число (по желанию)
number_1 = int(input('Введите первое число: '))
number_2 = int(input('Введите второе число: '))
number_3 = int(input('Введите третье число: '))
max = 0

if number_1 > max:
    max = number_1

if number_2 > max:
    max = number_2

if number_3 > max:
    max = number_3

print(max)
